In [62]:
import pandas as pd
import numpy as np

In [63]:
df = pd.DataFrame({'From_To': ['LoNDon_paris', 'MAdrid_miLAN', 'londON_StockhOlm','Budapest_PaRis', 'Brussels_londOn'],
                    'FlightNumber': [10045, np.nan, 10065, np.nan, 10085],
                    'RecentDelays': [[23, 47], [], [24, 43, 87], [13], [67, 32]],
                'Airline': ['KLM(!)', '<Air France> (12)', '(British Airways. )','12. Air France', '"Swiss Air"']})

In [64]:
df

            From_To  FlightNumber  RecentDelays              Airline
0      LoNDon_paris       10045.0      [23, 47]               KLM(!)
1      MAdrid_miLAN           NaN            []    <Air France> (12)
2  londON_StockhOlm       10065.0  [24, 43, 87]  (British Airways. )
3    Budapest_PaRis           NaN          [13]       12. Air France
4   Brussels_londOn       10085.0      [67, 32]          "Swiss Air"

In [65]:
df.dtypes

From_To          object
FlightNumber    float64
RecentDelays     object
Airline          object
dtype: object

# Problem 1

In [66]:
df['FlightNumber']

0    10045.0
1        NaN
2    10065.0
3        NaN
4    10085.0
Name: FlightNumber, dtype: float64

In [67]:
values=list(range(10045,10086,10))
values

[10045, 10055, 10065, 10075, 10085]

In [68]:
type(values)

list

In [69]:
df['FlightNumber']=values
df['FlightNumber']

0    10045
1    10055
2    10065
3    10075
4    10085
Name: FlightNumber, dtype: int64

In [70]:
df.dtypes

From_To         object
FlightNumber     int64
RecentDelays    object
Airline         object
dtype: object

In [71]:
df

            From_To  FlightNumber  RecentDelays              Airline
0      LoNDon_paris         10045      [23, 47]               KLM(!)
1      MAdrid_miLAN         10055            []    <Air France> (12)
2  londON_StockhOlm         10065  [24, 43, 87]  (British Airways. )
3    Budapest_PaRis         10075          [13]       12. Air France
4   Brussels_londOn         10085      [67, 32]          "Swiss Air"

# Problem 2

In [72]:
df['From_To']
df1=pd.DataFrame()

In [73]:
df1['From']=df['From_To'].map(lambda x: x.split('_')[0])
df1['To']=df['From_To'].map(lambda x: x.split('_')[1])
df1

       From         To
0    LoNDon      paris
1    MAdrid      miLAN
2    londON  StockhOlm
3  Budapest      PaRis
4  Brussels     londOn

# Problem 3

In [74]:
df1['From']=df1['From'].map(lambda x : x.capitalize())
df1['From']

0      London
1      Madrid
2      London
3    Budapest
4    Brussels
Name: From, dtype: object

In [75]:
df1['To']=df1['To'].map(lambda x : x.capitalize())
df1['To']

0        Paris
1        Milan
2    Stockholm
3        Paris
4       London
Name: To, dtype: object

In [76]:
df1

       From         To
0    London      Paris
1    Madrid      Milan
2    London  Stockholm
3  Budapest      Paris
4  Brussels     London

# Problem 4

In [77]:
df.drop(columns=['From_To'],inplace=True)
df

   FlightNumber  RecentDelays              Airline
0         10045      [23, 47]               KLM(!)
1         10055            []    <Air France> (12)
2         10065  [24, 43, 87]  (British Airways. )
3         10075          [13]       12. Air France
4         10085      [67, 32]          "Swiss Air"

In [78]:
df['From']=df1['From']
df

   FlightNumber  RecentDelays              Airline      From
0         10045      [23, 47]               KLM(!)    London
1         10055            []    <Air France> (12)    Madrid
2         10065  [24, 43, 87]  (British Airways. )    London
3         10075          [13]       12. Air France  Budapest
4         10085      [67, 32]          "Swiss Air"  Brussels

# Problem 5

In [89]:
dff=df.copy()

In [90]:
index=iter((0,1,2))

def get(x):
    try:
        return x[n]
    except:
        return np.nan

In [91]:
n=next(index)

In [92]:
dff['delay_1'] = dff['RecentDelays'].map(get)
dff

   FlightNumber  RecentDelays              Airline      From  delay_1
0         10045      [23, 47]               KLM(!)    London     23.0
1         10055            []    <Air France> (12)    Madrid      NaN
2         10065  [24, 43, 87]  (British Airways. )    London     24.0
3         10075          [13]       12. Air France  Budapest     13.0
4         10085      [67, 32]          "Swiss Air"  Brussels     67.0

In [93]:
n=next(index)
dff['delay_2'] = dff['RecentDelays'].map(get)
dff

   FlightNumber  RecentDelays              Airline      From  delay_1  delay_2
0         10045      [23, 47]               KLM(!)    London     23.0     47.0
1         10055            []    <Air France> (12)    Madrid      NaN      NaN
2         10065  [24, 43, 87]  (British Airways. )    London     24.0     43.0
3         10075          [13]       12. Air France  Budapest     13.0      NaN
4         10085      [67, 32]          "Swiss Air"  Brussels     67.0     32.0

In [94]:
n=next(index)
dff['delay_3'] = dff['RecentDelays'].map(get)
dff

,FlightNumber,RecentDelays,Airline,From,delay_1,delay_2,delay_3
0,10045,"[23, 47]",KLM(!),London,23.0,47.0,NaN
1,10055,[],<Air France> (12),Madrid,NaN,NaN,NaN
2,10065,"[24, 43, 87]",(British Airways. ),London,24.0,43.0,87.0
3,10075,[13],12. Air France,Budapest,13.0,NaN,NaN
4,10085,"[67, 32]","""Swiss Air""",Brussels,67.0,32.0,NaN

In [97]:
dff.drop(columns=['RecentDelays'],inplace=True)

In [98]:
dff

   FlightNumber              Airline      From  delay_1  delay_2  delay_3
0         10045               KLM(!)    London     23.0     47.0      NaN
1         10055    <Air France> (12)    Madrid      NaN      NaN      NaN
2         10065  (British Airways. )    London     24.0     43.0     87.0
3         10075       12. Air France  Budapest     13.0      NaN      NaN
4         10085          "Swiss Air"  Brussels     67.0     32.0      NaN